-- Сиды для таблицы groups
INSERT INTO groups (group_name) VALUES
('Группа 1'),
('Группа 2'),
('Группа 3'),
('Группа 4');

-- Сиды для таблицы students
INSERT INTO students (group_id, student_name) VALUES
(1, 'Студент 1-1'),
(1, 'Студент 1-2'),
(1, 'Студент 1-3'),
(1, 'Студент 1-4'),
(1, 'Студент 1-5'),
(2, 'Студент 2-1'),
(2, 'Студент 2-2'),
(2, 'Студент 2-3'),
(2, 'Студент 2-4'),
(2, 'Студент 2-5'),
(3, 'Студент 3-1'),
(3, 'Студент 3-2'),
(3, 'Студент 3-3'),
(3, 'Студент 3-4'),
(3, 'Студент 3-5'),
(4, 'Студент 4-1'),
(4, 'Студент 4-2'),
(4, 'Студент 4-3'),
(4, 'Студент 4-4'),
(4, 'Студент 4-5');

-- Сиды для таблицы lessons
INSERT INTO lessons (title, lesson_number, lesson_day, place, group_id) VALUES
-- Уроки для группы 1
-- понедельник
('Математика', 1, 1, 101, 1),
('Физика', 2, 1, 102, 1),
('Химия', 3, 1, 103, 1),
('История', 4, 1, 104, 1),
('География', 5, 1, 105, 1),
('Биология', 6, 1, 106, 1),

-- вторник

('Физика', 2, 2, 102, 1),
('Химия', 3, 2, 103, 1),
('История', 4, 2, 104, 1),
('География', 5, 2, 105, 1),
('Математика', 1, 2, 101, 1),
('Математика', 1, 2, 101, 1),
('Биология', 6, 2, 106, 1),
-- среда

('Математика', 1, 3, 101, 1),
('География', 5, 3, 105, 1),
('Физика', 2, 3, 102, 1),
('География', 5, 3, 105, 1),
('Химия', 3, 3, 103, 1),
('История', 4, 3, 104, 1),
('Биология', 6, 3, 106, 1),

-- четверг

('Математика', 1, 4, 101, 1),
('История', 4, 4, 104, 1),
('Биология', 6, 4, 106, 1),

-- пятница
('Химия', 3, 5, 103, 1),
('История', 4, 5, 104, 1),
('Математика', 1, 5, 101, 1),
('География', 5, 5, 105, 1),
('Физика', 2, 5, 102, 1),
('География', 5, 5, 105, 1),
('Биология', 6, 5, 106, 1),

-- суббота

('Математика', 1, 6, 101, 1),
('География', 5, 6, 105, 1),
('Физика', 2, 6, 102, 1),
('География', 5, 6, 105, 1),
('Химия', 3, 6, 103, 1),
('История', 4, 6, 104, 1),
('Биология', 6, 6, 106, 1),
-- Уроки для группы 2
('Математика', 1, 1, 201, 2),
('Физика', 2, 2, 202, 2),
('Химия', 3, 3, 203, 2),
('История', 4, 4, 204, 2),
('География', 5, 5, 205, 2),
('Биология', 6, 6, 206, 2),
-- Уроки для группы 3
('Математика', 1, 1, 301, 3),
('Физика', 2, 2, 302, 3),
('Химия', 3, 3, 303, 3),
('История', 4, 4, 304, 3),
('География', 5, 5, 305, 3),
('Биология', 6, 6, 306, 3),
-- Уроки для группы 4
('Математика', 1, 1, 401, 4),
('Физика', 2, 2, 402, 4),
('Химия', 3, 3, 403, 4),
('История', 4, 4, 404, 4),
('География', 5, 5, 405, 4),
('Биология', 6, 6, 406, 4);